console.log('Текст из script.js!');
// 1. Создайте переменную `num` и присвойте ей значение `123`. Выведите значение этой переменной в консоль.
// let num = 123;
// console.log(num);
// // 2. Создайте переменную `а` и присвойте ей значение `5`, переопределите переменную `а` на значение `7`, выведите переменную `а` в консоль.
// let a = 5;
// console.log('a = ', a);
// a = 7;
// console.log('a = ', a);

// // 3. Создайте переменную `b`. Запишите в нее сумму чисел `1`, `2` и `3`. С помощью функции `console.log` выведите в консоль содержимое переменной `b`.
// let b = 1 + 2 + 3;

// console.log('b = ', b);

// 4. Создайте два вида комментариев в вашем коде, добавьте в них произвольный текст.
/*комментарии
*/
// комментарии 

// 1. Создайте две переменные, одна будет хранить ваш возраст (девушкам всегда 18), а другая переменная будет хранить текущий год (все созданные переменные должны быть логично названы).
// - Создайте переменную суммы и присвойте сумму чисел из двух переменных.
// - Создайте переменную разности и присвойте разность текущего года и вашего возраста.
// - Создайте переменную произведения и присвойте произведение чисел двух переменных.
// - Создайте переменную частного и присвойте деление чисел текущего года к вашему возрасту.
/*
const myAge = 18;
const currentYears = new Date().getFullYear();
console.log(myAge, currentYears);
const sumAge = myAge + currentYears;
console.log(sumAge);

const difAge = currentYears - myAge;
console.log(difAge);
const multiplicationAge = currentYears * myAge;
console.log(multiplicationAge);
const divisionAge = currentYears / myAge;
console.log(divisionAge);
*/

// Не запуская код, определите, что отобразится в консоли: 
// `let a = 5 + 5 * 3 + 3;`
// Не запуская код, определите, что отобразится в консоли:
// `let b = 8 / 2 + 2;`
// Не запуская код, определите, что отобразится в консоли:
// `let c = (2 + 3) * (2 + 3);`
// Не запуская код, определите, что отобразится в консоли:
// `let d = (2 + 3) * 2 + 3;`
// Не запуская код, определите, что отобразится в консоли:
// `let e = (2 * 8) / 4;`
// Не запуская код, определите, что отобразится в консоли:
// `let f = 2 * (8 / 4);`

// 1. Запишите в переменную `a` число `0.1`, а в переменную `b` - число `0.2`. Найдите сумму значений этих переменных и выведите ее на экран.

let a = 0.1;
let b = 0.2;
console.log(a + b);


// 2. Создайте переменную `c`, запишите в нее какое-нибудь положительное или отрицательное число. Выведите на экран это число с обратным знаком.
let c = -6;
console.log(-c);