// Задание 1
// Необходимо создать переменную в которой будет храниться температура в градусах Цельсия, преобразовать значение в температуру по фаренгейту.
// Формула перевода градусов Цельсия в градусы Фаренгейта: градусы Фаренгейта = (9 / 5) * градусы Цельсия + 32
// Вывести в консоль температуру в Цельсиях и Фаренгейтах.


let tempCelsi = 30;
let tempFaringeit = (9 / 5) * tempCelsi + 32;
console.log('Температура по Цельсия =', tempCelsi, 'градусов');
console.log('Температура по Фарингейту =', tempFaringeit, 'градусов');


// Задание 2
// Необходимо создать переменную name, записать в эту переменную свое имя. 
// Необходимо также создать переменную admin и присвоить этой переменной значение из переменной name. Вывести значение переменной admin в консоль.


let myName = 'Maria';
let admin = myName;
console.log(admin);


// let name, admin;
// name = 'Maria';
// admin = name;
