// Задание 1: 
// 1. Создать две переменные и спросить у пользователя значения для данных 
// переменных. Одна переменная будет хранить имя пользователя, другая его возраст.
// 2. Вывести на экран текст: 
// “Добро пожаловать, `имя`. Ваше количество оборотов вокруг солнца - `возраст`.”


// let nameUser = prompt('Как вас зовут?');
// let ageUser = Number(prompt('Укажите ваш возраст'));
// console.log(`Добро пожаловать, ${nameUser}.  Ваше количество оборотов вокруг солнца - ${ageUser}`);


// Задание 2: 
 
// 1. Найти остаток от деления переменных `a` на `b`, где a = 13, b = 5.
// const a = 13;
// const b = 5;

// console.log(a % b);

// 2. Что выведет на экран (Сначала проговорите, потом проверьте)
// ```
// let a;
// alert(a); 
// ```
// 3. Что выведет на экран (Сначала проговорите, потом проверьте)
// ```
// alert('abc' * 3);
// ```
// 4. Что выведет на экран (Сначала проговорите, потом проверьте)
// ```
// alert(1 / 0);
// alert(-1 / 0);
// ```
// 5. Что выведет на экран (Сначала проговорите, потом проверьте)
// // ```
// alert('2' * '3');
// ```
 

// Задание 3: 
// 1. Сознательно допустите ошибку в вашем коде. Убедитесь, что ошибка появляется 
// в консоли. Определите, в какой строке кода случилась ошибка.
// 2. Необходимо вывести в консоль результат суммы переменных a = '2', b = '3'.


// 3. Пользователь с клавиатуры вводит 2 числа, необходимо в консоль вывести весь 
// текст ниже, одной строкой с переносами строк:
 
// Сумма чисел равна “результат”.
// Разность чисел равна “результат”.
// Произведение чисел равно “результат”.
// Частное чисел равно “результат”.
// Остаток от деления чисел равен “результат”.

// const a = Number.parseFloat(prompt('Введите первое число'));
// const b = Number.parseFloat(prompt('Введите второе число'));

// console.log(`Сумма чисел равна ${a+b}.
// Разность чисел равна ${a-b}.
// Произведение чисел равно ${a*b}.
// Частное чисел равно ${a/b}.
// Остаток от деления чисел равен ${a%b}.`);



// 1. Не запуская код, определите, что выводится в консоль:
 

console.log(String(true));
console.log('a' + true); 
console.log(Number(true));
console.log(true + 1);
console.log(true + true);
console.log(true - true);
console.log(String(true) + Number(true));


